<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"dafb60f82d9c732aa240360ddb195cb4d5ddd8e9acfd0ab12afad8ff55e247d3","plan_job_ref":"Job Terraform Plan #1 at https://github.com/nyancat3/daily_report_evaluator/actions/runs/10791583182","plan_out_hash":"a302a891e8609f1178aade8682aba6f6032102f2fb761ff8a3caf47b3956fb15","plan_hash":"415778e61827ed2b3b1d577dad3c6f81f3165928191bd434a360593d5a0beefa","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __.__
With backend config: `bucket=daily-report-evaluator-terraform-state
key=terraform.tfstate
region=ap-northeast-1
`<details open><summary>With variables</summary>

```hcl
aws_account_id         = "209268065476"
aws_region             = "ap-northeast-1"
open_ai_api_key        = "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"
slack_bot_token        = "xoxb-6290730965926-7382969331987-nUgroQKCNZJ9ic3jT0YvXngD"
slack_signing_secret   = "a9ce84162db0a3ec43c6fdadc95afd9e"
terraform_state_bucket = "daily-report-evaluator-terraform-state"
```
</details>
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.lambda_function will be updated in-place
!~  resource "aws_lambda_function" "lambda_function" {
        id                             = "daily-report-evaluator"
!~      layers                         = [
-           "arn:aws:lambda:ap-northeast-1:209268065476:layer:lambda_layer_slack_bolt:4",
        ] -> (known after apply)
        tags                           = {}
#        (28 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.lambda_layer must be replaced
-/+ resource "aws_lambda_layer_version" "lambda_layer" {
!~      arn                         = "arn:aws:lambda:ap-northeast-1:209268065476:layer:lambda_layer_slack_bolt:4" -> (known after apply)
!~      code_sha256                 = "MUwQLdgEkhU4OCaNwKfDXndd+IioQ2LaIO1IPG92OgQ=" -> (known after apply)
-       compatible_architectures    = [] -> null
!~      created_date                = "2024-07-09T13:04:04.709+0000" -> (known after apply)
!~      id                          = "**************************************************************************" -> (known after apply)
!~      layer_arn                   = "arn:aws:lambda:ap-northeast-1:209268065476:layer:lambda_layer_slack_bolt" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!~      source_code_hash            = "MUwQLdgEkhU4OCaNwKfDXndd+IioQ2LaIO1IPG92OgQ=" -> "xOBilZvx61wu10R4VYdZKf9TbVJ+HdXM2sGJgWC0Ang=" # forces replacement
!~      source_code_size            = 2594972 -> (known after apply)
!~      version                     = "4" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #1](https://github.com/nyancat3/daily_report_evaluator/actions/runs/10791583182)